{
    "categories" : [
        [1, "Getting Started","Hello_World.png"],
        [2, "Message Routing","Routing_Templates.png"],
        [3, "Message Transformation","Transformation_Templates.png"],
        [4, "Messaging","Messaging_Templates.png"],
        [5, "SaaS Integration","SaaS_Templates.png"],
        [6, "Data Integration","DataIntegration_Templates.png"],
        [7, "Scheduled Task","Task_Templates.png"],
        [8, "Error Handling","ErrorHandling_Templates.png"],
        [9, "Docker/Kubernetes","Container_Templates.png"],
        [10, "Synapse Unit Testing","Testing_Templates.png"]
    ],
    "Samples" : [
        [1,0,"Hello World Service","This sample demonstrates a simple HTTP service.", "HelloWorldService"],
        [2,2,"Content Based Routing","This sample demonstrates content-based message routing in an integration solution.", "ContentBasedRouting"],
        [2,2,"Header Based Routing","This sample demonstrates header-based message routing in an integration solution.", "HeaderBasedRouting"],
        [2,15,"Message Filtering","This sample demonstrates message filtering in an integration solution.", "MessageFiltering"],
        [2,17,"Protocol Switching","This sample demonstrates protocol switching in an integration solution.", "ProtocolSwitching"],
        [2,18,"Proxying a REST Service","This sample exposes a virtual service, which acts as a proxy to an existing RESTful service.", "ProxyingaRESTService"],
        [2,19,"Proxying a SOAP Service","This sample exposes a virtual service, which acts as a proxy to an existing SOAP service.", "ProxyingaSOAPService"],
        [2,23,"Scatter Gather Integration Pattern","This sample demonstrates how to implement the Scatter Gather messaging pattern.", "ScatterGatherIntegrationPattern"],
        [4,7,"File Transfer","This sample demonstrates file handling in an integration solution.", "FileTransfer"],
        [4,8,"Guaranteed Delivery","This sample demonstrates guaranteed message delivery using the Store and Forward messaging pattern.", "GuaranteedDelivery"],
        [4,12,"JMS Integration","This sample demonstrates how the WSO2 Enterprise Integrator integrates with JMS brokers.", "JMSIntegration"],
        [4,14,"Kafka Consumer and Producer","This sample demonstrates how Kafka messages are consumed and produced using WSO2 Kafka Connector.", "KafkaConsumerandProducer"],
        [4,20,"RabbitMQ Integration","This sample demonstrates how the WSO2 Enterprise Integrator integrates with RabbitMQ.", "RabbitMQIntegration"],
        [3,13,"JSON to XML Mapping","This sample demonstrates JSON to XML mapping using the Data Mapper mediator.", "JSONtoXMLMapping"],
        [3,22,"REST to SOAP Conversion","This sample exposes an existing SOAP service as a RESTful API.", "RESTtoSOAPConversion"],
        [3,25,"XML to JSON Mapping","This sample demonstrates XML to JSON mapping using the Data Mapper mediator.", "XMLtoJSONMapping"],
        [3,26,"XML To JSON Transformation","This sample demonstrates  XML to JSON message transformation capabilities.", "XMLToJSONTransformation"],
        [6,21,"REST Data Service","This sample demonstrates a data service exposed as a RESTful service.", "RESTDataService"],
        [6,24,"Students Data Service","This sample demonstrates a SOAP data service.", "StudentsDataService"],
        [9,10,"Hello Docker","This sample demonstrates how to deploy a simple Hello World service on Docker.", "HelloDocker"],
        [9,11,"Hello Kubernetes","This sample demonstrates how to deploy a simple Hello World service on Kubernetes.", "HelloKubernetes"],
        [8,5,"Exception Handling","This sample demonstrates the exception handling capabilities of WSO2 Enterprise Integrator.", "ExceptionHandling"],
        [10,101,"API Testing","This sample demonstrates unit testing of a REST API artifact using WSO2 Integration Studio.", "APITesting"],
        [10,30,"Unit Test Tutorial","This sample demonstrates the Unit Testing capabilities of WSO2 Integration Studio.", "UnitTestTutorial"],
        [5,4,"Email Service","This sample demonstrates how to send and receive emails using WSO2 Email Connector.", "EmailService"],
        [5,6,"Fetch SalesForce Accounts","This sample demonstrates how to fetch leads from the Salesforce system.", "FetchSalesForceAccounts"],
        [7,103,"Database Polling","This sample demonstrates how to periodically poll data from a database and then trigger a message flow.", "DatabasePolling"],
        [7,16,"Periodical Scheduled Tasks","This sample demonstrates how scheduled integration tasks are created and periodically triggered.", "PeriodicalScheduledTasks"]
    ]   
}
